{"class_name": "Model", "config": {"name": "Classification", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "layer2", "class_name": "Dense", "config": {"name": "layer2", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"name": "layer3", "class_name": "Dense", "config": {"name": "layer3", "trainable": true, "units": 55, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["layer3", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}